![Ironhack logo](https://i.imgur.com/1QgrNNw.png)

# Lab | Introduction to Pandas

## Introduction

In the Introduction to Pandas lesson, we learned about the two main data structures in Pandas (Series and DataFrames), how to work with them, how to obtain them from other data structures, and how to perform basic calculations with them.

The goal of this lab is to help you practice the concepts you learned in the lesson and provide you with some hands-on experience working with Pandas.

## Getting Started

Read the instructions for each cell and provide your answers. Make sure to test your answers in each cell and save. Jupyter Notebook should automatically save your work progress. But it's a good idea to periodically save your work manually just in case.

## Resources

- [Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/)
- [Intro to Pandas Data Structures](https://pandas.pydata.org/pandas-docs/stable/dsintro.html)
- [Descriptive Statistics for Pandas DataFrame](https://chrisalbon.com/python/data_wrangling/pandas_dataframe_descriptive_stats/)

# Introduction to Pandas

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

#### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
# your code here
import numpy as np
import pandas as pd

#### 2. Create a Pandas Series containing the elements of the list below.

Expected output:

````python
            0     5.7
            1    75.2
            2    74.4
            3    84.0
            4    66.5
            5    66.3
            6    55.8
            7    75.7
            8    29.1
            9    43.7
            dtype: float64
    
````

In [30]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [31]:
# your code here
pd.Series(lst)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

#### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [32]:
# your code here
lst[2]

74.4

#### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

Expected output:

|    |    0 |    1 |    2 |    3 |    4 |
|---:|-----:|-----:|-----:|-----:|-----:|
|  0 | 53.1 | 95   | 67.5 | 35   | 78.4 |
|  1 | 61.3 | 40.8 | 30.8 | 37.8 | 87.6 |
|  2 | 20.6 | 73.2 | 44.2 | 14.6 | 91.8 |
|  3 | 57.4 |  0.1 | 96.1 |  4.2 | 69.5 |
|  4 | 83.6 | 20.5 | 85.4 | 22.8 | 35.9 |
|  5 | 49   | 69   |  0.1 | 31.8 | 89.1 |
|  6 | 23.3 | 40.7 | 95   | 83.8 | 26.9 |
|  7 | 27.6 | 26.4 | 53.8 | 88.8 | 68.5 |
|  8 | 96.6 | 96.4 | 53.4 | 72.4 | 50.1 |
|  9 | 73.7 | 39   | 43.2 | 81.6 | 34.7 |

In [33]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [73]:
# your code here
pd.DataFrame(b)

   Score_1  Score_2  Score_3  Score_4  Score_5  total
0     53.1     95.0     67.5     35.0     78.4      0
1     61.3     40.8     30.8     37.8     87.6      0
2     20.6     73.2     44.2     14.6     91.8      0
3     57.4      0.1     96.1      4.2     69.5      0
4     83.6     20.5     85.4     22.8     35.9      0
5     49.0     69.0      0.1     31.8     89.1      0
6     23.3     40.7     95.0     83.8     26.9      0
7     27.6     26.4     53.8     88.8     68.5      0
8     96.6     96.4     53.4     72.4     50.1      0
9     73.7     39.0     43.2     81.6     34.7      0

#### 5. Rename the data frame columns based on the names in the list below.

Expected output:

|    |   Score_1 |   Score_2 |   Score_3 |   Score_4 |   Score_5 |
|---:|----------:|----------:|----------:|----------:|----------:|
|  0 |      53.1 |      95   |      67.5 |      35   |      78.4 |
|  1 |      61.3 |      40.8 |      30.8 |      37.8 |      87.6 |
|  2 |      20.6 |      73.2 |      44.2 |      14.6 |      91.8 |
|  3 |      57.4 |       0.1 |      96.1 |       4.2 |      69.5 |
|  4 |      83.6 |      20.5 |      85.4 |      22.8 |      35.9 |
|  5 |      49   |      69   |       0.1 |      31.8 |      89.1 |
|  6 |      23.3 |      40.7 |      95   |      83.8 |      26.9 |
|  7 |      27.6 |      26.4 |      53.8 |      88.8 |      68.5 |
|  8 |      96.6 |      96.4 |      53.4 |      72.4 |      50.1 |
|  9 |      73.7 |      39   |      43.2 |      81.6 |      34.7 |

In [74]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [75]:
# your code here
b = pd.DataFrame(b,columns=colnames)

#### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

Expected output:

|    |   Score_1 |   Score_3 |   Score_5 |
|---:|----------:|----------:|----------:|
|  0 |      53.1 |      67.5 |      78.4 |
|  1 |      61.3 |      30.8 |      87.6 |
|  2 |      20.6 |      44.2 |      91.8 |
|  3 |      57.4 |      96.1 |      69.5 |
|  4 |      83.6 |      85.4 |      35.9 |
|  5 |      49   |       0.1 |      89.1 |
|  6 |      23.3 |      95   |      26.9 |
|  7 |      27.6 |      53.8 |      68.5 |
|  8 |      96.6 |      53.4 |      50.1 |
|  9 |      73.7 |      43.2 |      34.7 |

In [76]:
# your code here
b.loc[:,['Score_1','Score_3','Score_5']]

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

#### 7. From the original data frame, calculate the average Score_3 value.

Expected output:

````python
            56.95
````

In [77]:
# your code here
b['Score_3'].mean()

56.95000000000001

#### 8. From the original data frame, calculate the maximum Score_4 value.

Expected output:

````python
            88.8
````

In [78]:
# your code here
b['Score_4'].max()

88.8

#### 9. From the original data frame, calculate the median Score 2 value.

Expected output:

````python
            40.75
````

In [79]:
# your code here 
b.Score_2.median()

40.75

#### 10. Create a Pandas DataFrame from the dictionary of product orders below.

Expected output:

|    | Description                       |   Quantity |   UnitPrice |   Revenue |
|---:|:----------------------------------|-----------:|------------:|----------:|
|  0 | LUNCH BAG APPLE DESIGN            |          1 |        1.65 |      1.65 |
|  1 | SET OF 60 VINTAGE LEAF CAKE CASES |         24 |        0.55 |     13.2  |
|  2 | RIBBON REEL STRIPES DESIGN        |          1 |        1.65 |      1.65 |
|  3 | WORLD WAR 2 GLIDERS ASSTD DESIGNS |       2880 |        0.18 |    518.4  |
|  4 | PLAYING CARDS JUBILEE UNION JACK  |          2 |        1.25 |      2.5  |
|  5 | POPCORN HOLDER                    |          7 |        0.85 |      5.95 |
|  6 | BOX OF VINTAGE ALPHABET BLOCKS    |          1 |       11.95 |     11.95 |
|  7 | PARTY BUNTING                     |          4 |        4.95 |     19.8  |
|  8 | JAZZ HEARTS ADDRESS BOOK          |         10 |        0.19 |      1.9  |
|  9 | SET OF 4 SANTA PLACE SETTINGS     |         48 |        1.25 |     60    |

In [100]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [132]:
# your code here
orders = pd.DataFrame(data = orders)
orders

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

2978

#### 11. Calculate the total quantity ordered and revenue generated from these orders.

Expected output:

````python
            Quantity    2978.0
            Revenue      637.0
````

In [147]:
orders['Quantity'].sum()

2978

In [146]:
# your code here
orders['Revenue'].sum()

637.0

#### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.
Expected output:

````python
            Most expensive:  11.95
            Least expensive:  0.18
            Difference:  11.77
````

In [211]:
print(f'Most expensive: {orders.UnitPrice.max()}\nLeast Expensive: {orders.UnitPrice.min()}\nDifference: {orders.UnitPrice.max() - orders.UnitPrice.min() }')

Most expensive: 11.95
Least Expensive: 0.18
Difference: 11.77

In [213]:
# your code here
orders.iloc[[6,3],[0,2]]

                         Description  UnitPrice
6     BOX OF VINTAGE ALPHABET BLOCKS      11.95
3  WORLD WAR 2 GLIDERS ASSTD DESIGNS       0.18

In [215]:
orders.iloc[6,2] - orders.iloc[3,2]

11.77

# BONUS

#### 1 Create a random dataframe containing 3 columns and 10 rows. 

*Hint: You'll have to use a `numpy.random` method to create random observations*

**Example of output:**

|    |         0 |        1 |        2 |
|---:|----------:|---------:|---------:|
|  0 | 0.0883504 | 0.867054 | 0.977949 |
|  1 | 0.819555  | 0.643927 | 0.122975 |
|  2 | 0.484618  | 0.515125 | 0.807791 |
|  3 | 0.539583  | 0.620799 | 0.926963 |
|  4 | 0.0479896 | 0.772282 | 0.621921 |
|  5 | 0.1398    | 0.767678 | 0.678816 |
|  6 | 0.0895157 | 0.242867 | 0.887941 |
|  7 | 0.160186  | 0.750576 | 0.439416 |
|  8 | 0.982747  | 0.652903 | 0.575518 |
|  9 | 0.646373  | 0.523237 | 0.700222 |

In [45]:
lf = np.random.random((10,3))
lf = pd.DataFrame(lf)
lf

          0         1         2
0  0.946689  0.047003  0.965068
1  0.919844  0.512348  0.963808
2  0.179142  0.564373  0.386049
3  0.344959  0.651841  0.446034
4  0.102909  0.398505  0.304695
5  0.259134  0.946127  0.399130
6  0.163061  0.119102  0.920279
7  0.789085  0.830512  0.967747
8  0.344390  0.005270  0.383263
9  0.434752  0.353569  0.273433

#### 2 Create a random dataframe containing 3 columns and 10 rows with specific column names. 

Use `['column1', 'column2', 'column3']` as the column names.

**Example of output:**

|    |   column1 |   column2 |   column3 |
|---:|----------:|----------:|----------:|
|  0 |        10 |        21 |        45 |
|  1 |        32 |        87 |        39 |
|  2 |        93 |        53 |         8 |
|  3 |        52 |        77 |        41 |
|  4 |        72 |        50 |        31 |
|  5 |        16 |         6 |        41 |
|  6 |        66 |        33 |        62 |
|  7 |        97 |        50 |        92 |
|  8 |        21 |        71 |        42 |
|  9 |        91 |        97 |        32 |

In [54]:
# your code here
col = ['column1', 'column2', 'column3']
data_np= np.random.random((10,3))
data_pd= pd.DataFrame(data_np, columns = col)
data_pd

    column1   column2   column3
0  0.793580  0.334259  0.221316
1  0.553404  0.047637  0.100950
2  0.267951  0.913498  0.064876
3  0.263499  0.864332  0.512316
4  0.184144  0.629135  0.254313
5  0.972395  0.688527  0.166855
6  0.919017  0.110994  0.907099
7  0.515804  0.675169  0.304142
8  0.570220  0.559369  0.699998
9  0.238415  0.489528  0.686588

#### 3 Create a random dataframe containing N columns and M rows with specific column names.

For this task you'll have to name the columns as `['column1', 'column2', 'column3', ...,'columnN']`. You can use a list comprehension to do that.

In [70]:
N = 10
M = 30
cols = ['column1', 'column2', 'column3','column4','column5','column6','column7','column8','columnM','columnN']
# your code here

data_n = pd.DataFrame(np.random.random((M,N)),columns = cols)
data_n

,column1,column2,column3,column4,column5,column6,column7,column8,columnM,columnN
0,0.252020,0.033733,0.798819,0.378546,0.116342,0.521625,0.436320,0.577746,0.404206,0.221247
1,0.478668,0.688271,0.127543,0.470210,0.677889,0.037007,0.497891,0.402297,0.808922,0.673568
2,0.911926,0.648074,0.516646,0.317259,0.333884,0.081308,0.066391,0.541655,0.807713,0.685409
3,0.729267,0.356968,0.775709,0.355338,0.324115,0.513210,0.746720,0.100721,0.798618,0.435900
4,0.275649,0.227686,0.551286,0.577599,0.220219,0.071984,0.295008,0.753436,0.741728,0.720301
5,0.033699,0.187797,0.341305,0.613432,0.738949,0.873794,0.054382,0.573583,0.283495,0.988098
6,0.840486,0.367709,0.552893,0.932226,0.103866,0.041493,0.937515,0.894233,0.548492,0.158847
7,0.819502,0.591339,0.747028,0.708213,0.642965,0.019224,0.899801,0.534090,0.260619,0.725043
8,0.884730,0.134521,0.527193,0.526830,0.782617,0.058195,0.301828,0.063969,0.132937,0.090317
9,0.694581,0.688718,0.954922,0.756382,0.770550,0.494255,0.811676,0.344029,0.545655,0.859435
10,0.978069,0.950606,0.659400,0.953167,0.206766,0.733005,0.692558,0.202299,0.798025,0.838899
11,0.889356,0.123388,0.913408,0.922395,0.002367,0.429934,0.243013,0.328719,0.309881,0.003831
12,0.466940,0.543647,0.511906,0.475314,0.664297,0.915767,0.981286,0.970323,0.870701,0.932255
13,0.847897,0.990985,0.755801,0.360358,0.022342,0.720419,0.826345,0.332286,0.174707,0.746251
14,0.096549,0.510402,0.968720,0.890471,0.180007,0.137778,0.240537,0.043953,0.353862,0.435537
15,0.048525,0.347472,0.293363,0.144852,0.617707,0.147483,0.165750,0.513884,0.449254,0.720547
16,0.146162,0.341077,0.106315,0.593443,0.881761,0.401622,0.644079,0.475658,0.551055,0.823019
17,0.855600,0.581057,0.826500,0.431597,0.310765,0.504890,0.370490,0.609202,0.571240,0.002910
18,0.863146,0.403815,0.440111,0.436596,0.605050,0.603610,0.285471,0.596747,0.461619,0.173686
19,0.836650,0.598277,0.230052,0.096210,0.504843,0.125549,0.720064,0.833015,0.875956,0.971780
20,0.167177,0.234702,0.853656,0.523228,0.270433,0.694888,0.807500,0.855352,0.958099,0.041006
21,0.420840,0.473726,0.340244,0.304590,0.055121,0.958613,0.182231,0.513272,0.491434,0.329781
22,0.182743,0.805988,0.547645,0.658274,0.091724,0.076690,0.967199,0.505191,0.752183,0.446482
23,0.178320,0.656314,0.839853,0.846061,0.741449,0.461754,0.237593,0.977266,0.829687,0.676755
24,0.564813,0.766087,0.848871,0.503894,0.707568,0.577409,0.832837,0.833403,0.840916,0.745211
25,0.326786,0.447346,0.426994,0.462060,0.624481,0.589031,0.462093,0.783438,0.972206,0.607946
26,0.542629,0.814542,0.366405,0.007555,0.261821,0.430115,0.763704,0.317276,0.332111,0.690000
27,0.663240,0.490985,0.391408,0.199079,0.616032,0.337544,0.563896,0.349931,0.405020,0.499001
28,0.724620,0.843590,0.148871,0.220311,0.457002,0.502471,0.929500,0.098155,0.672127,0.240147
29,0.488195,0.383903,0.810514,0.717104,0.782576,0.544850,0.706342,0.812699,0.021906,0.379675